cat_book_backend/app/controllers/cats_controller.rb

INSERT INTO "cats" ("firstName", "lastName", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["firstName", "Erica"], ["lastName", "Gates"], ["age", 32], ["enjoys", "long walks on the beach"], ["created_at", "2020-08-21 18:32:57.988628"], ["updated_at", "2020-08-21 18:32:57.988628"]]
---
    def create
        cat = Cat.create(cat_params)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "firstName" = $1, "lastName" = $2, "enjoys" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["firstName", "ruh"], ["lastName", "ruh"], ["enjoys", "sneak attacks"], ["updated_at", "2020-08-21 21:43:20.978249"], ["id", 4]]
---
    def update
        cat = Cat.find(params[:id])
        cat.update(cat_params)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
    def destroy
        cat=Cat.find(params[:id])
        cat.destroy